#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.gke_web_stg_web.google_container_node_pool.node_pool will be created
  + resource "google_container_node_pool" "node_pool" {
      + cluster             = "gke"
      + id                  = (known after apply)
      + initial_node_count  = (known after apply)
      + instance_group_urls = (known after apply)
      + location            = "europe-west4"
      + max_pods_per_node   = 110
      + name                = "default"
      + name_prefix         = (known after apply)
      + node_count          = 3
      + node_locations      = (known after apply)
      + project             = "sander-gke-project"
      + region              = (known after apply)
      + version             = (known after apply)
      + zone                = (known after apply)

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = 30
          + disk_type         = "pd-ssd"
          + guest_accelerator = (known after apply)
          + image_type        = "COS"
          + labels            = {
              + "cluster_name" = "gke"
              + "node_pool"    = "default"
              + "suffix"       = "01"
              + "workload"     = "default"
            }
          + local_ssd_count   = 0
          + machine_type      = "n1-standard-2"
          + metadata          = (known after apply)
          + min_cpu_platform  = "Intel Broadwell"
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = false
          + service_account   = (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + taint {
              + effect = "NO_SCHEDULE"
              + key    = "workload"
              + value  = "default"
            }

          + workload_metadata_config {
              + node_metadata = "SECURE"
            }
        }
    }

  # module.gke_web_stg_web.google_project_iam_member.k8s-dev-ci-cd will be created
  + resource "google_project_iam_member" "k8s-dev-ci-cd" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:39973446187@cloudbuild.gserviceaccount.com"
      + project = "sander-gke-project"
      + role    = "roles/container.developer"
    }

  # module.gke_web_stg_web.google_project_iam_member.project-cloudsql will be created
  + resource "google_project_iam_member" "project-cloudsql" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "sander-gke-project"
      + role    = "roles/cloudsql.client"
    }

  # module.gke_web_stg_web.google_project_iam_member.project-logging-writer will be created
  + resource "google_project_iam_member" "project-logging-writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "sander-gke-project"
      + role    = "roles/logging.logWriter"
    }

  # module.gke_web_stg_web.google_project_iam_member.project-metric-writer will be created
  + resource "google_project_iam_member" "project-metric-writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "sander-gke-project"
      + role    = "roles/monitoring.metricWriter"
    }

  # module.gke_web_stg_web.google_project_iam_member.project-trace-agent will be created
  + resource "google_project_iam_member" "project-trace-agent" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "sander-gke-project"
      + role    = "roles/cloudtrace.agent"
    }

  # module.gke_web_stg_web.google_service_account.node_pool_service_account will be created
  + resource "google_service_account" "node_pool_service_account" {
      + account_id   = (known after apply)
      + display_name = "default"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "sander-gke-project"
      + unique_id    = (known after apply)
    }

  # module.gke_web_stg_web.google_storage_bucket_iam_member.member-eu will be created
  + resource "google_storage_bucket_iam_member" "member-eu" {
      + bucket = "eu.artifacts.loveholidays-ci-cd.appspot.com"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectViewer"
    }

  # module.gke_web_stg_web.google_storage_bucket_iam_member.member-usa will be created
  + resource "google_storage_bucket_iam_member" "member-usa" {
      + bucket = "artifacts.loveholidays-ci-cd.appspot.com"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectViewer"
    }

  # module.gke_web_stg_web.random_string.this will be created
  + resource "random_string" "this" {
      + id          = (known after apply)
      + keepers     = {
          + "project" = "sander-gke-project"
        }
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Warning: Quoted references are deprecated

  on .terraform/modules/gke_web_stg_container_cluster/container_cluster/main.tf line 2, in resource "google_container_cluster" "primary":
   2:   provider                    = "google-beta"

In this context, references are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted references are now
deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this reference to silence this warning.

(and one more similar warning elsewhere)


Warning: Interpolation-only expressions are deprecated

  on .terraform/modules/gke_web_stg_web/node_pool/sa.tf line 2, in resource "google_service_account" "node_pool_service_account":
   2:   project      = "${random_string.this.keepers.project}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 5 more similar warnings elsewhere)

```

</details>

*Workflow: `Terraform`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
